MagnusErler/WiFiLocationTracker/stm32/geolocation/main_geolocation/main_geolocation.c
                join_accept_payload[4] = (getTemperature()/40.0) * 255;
                join_accept_payload[5] = ((getBatteryVoltage() - 1.7) / (3.35 - 1.7))*255;

                SMTC_HAL_TRACE_INFO("Sending join accept payload: %u, %u, %u, %u, %u, %u\r\n", join_accept_payload[0], join_accept_payload[1], join_accept_payload[2], join_accept_payload[3], join_accept_payload[4], join_accept_payload[5]);
                smtc_modem_request_uplink( stack_id, 10, false, join_accept_payload, 6 );
                restart_occured = false;
            }
            
            break;

        case SMTC_MODEM_EVENT_TXDONE:
            SMTC_HAL_TRACE_INFO( "Event received: TXDONE (%d)\r\n", current_event.event_data.txdone.status );
            SMTC_HAL_TRACE_INFO( "Transmission done\r\n" );
            break;

        case SMTC_MODEM_EVENT_DOWNDATA:
            SMTC_HAL_TRACE_INFO( "Event received: DOWNDATA\r\n" );
            // Get downlink data

            // reset rx_payload
            memset( rx_payload, 0, SMTC_MODEM_MAX_LORAWAN_PAYLOAD_LENGTH );
            smtc_modem_get_downlink_data( rx_payload, &rx_payload_size, &rx_metadata, &rx_remaining );
            SMTC_HAL_TRACE_PRINTF( "Data received on port %u\r\n", rx_metadata.fport );
            SMTC_HAL_TRACE_ARRAY( "Received payload", rx_payload, rx_payload_size );

            switch (rx_metadata.fport) {
            case 1:

                // if (rx_payload_size == 1) {
                //     SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", rx_payload[0]);
                //     GEOLOCATION_WIFI_SCAN_PERIOD_S = rx_payload[0] / 60.0;
                // } else if (rx_payload_size == 2) {
                //     SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", (rx_payload[0] << 8) + rx_payload[1]);
                //     GEOLOCATION_WIFI_SCAN_PERIOD_S = (rx_payload[0] << 8) + rx_payload[1];
                // }

                if (GEOLOCATION_WIFI_SCAN_PERIOD_S != ((rx_payload[0] << 8) + rx_payload[1]) * 60.0) {
                    GEOLOCATION_WIFI_SCAN_PERIOD_S = ((rx_payload[0] << 8) + rx_payload[1]) * 60.0;
                    GEOLOCATION_GNSS_SCAN_PERIOD_S = GEOLOCATION_WIFI_SCAN_PERIOD_S;
                    SMTC_HAL_TRACE_PRINTF("Setting new Wi-Fi and GNSS scan period to %u s\r\n", GEOLOCATION_WIFI_SCAN_PERIOD_S);
                    
                    if (enableWiFiGNSS == 0) {
                        // cancel the current Wi-Fi scan (not possible if the scan has already started)
                        smtc_modem_wifi_scan_cancel( stack_id );
                        // cancel the current GNSS scan (not possible if the scan has already started)
                        smtc_modem_gnss_scan_cancel( stack_id );
                    }
                    if (enableWiFiGNSS == 1) {
                        smtc_modem_gnss_scan_cancel( stack_id );
                        // cancel the current Wi-Fi scan (not possible if the scan has already started)
                        smtc_modem_wifi_scan_cancel( stack_id );
                        // set the new Wi-Fi scan period
                        smtc_modem_wifi_scan( stack_id, GEOLOCATION_WIFI_SCAN_PERIOD_S );
                    }
                    if (enableWiFiGNSS == 2) {
                        smtc_modem_wifi_scan_cancel( stack_id );
                        // cancel the current GNSS scan (not possible if the scan has already started)
                        smtc_modem_gnss_scan_cancel( stack_id );
                        // set the new GNSS scan period
                        smtc_modem_gnss_scan( stack_id, SMTC_MODEM_GNSS_MODE_MOBILE, GEOLOCATION_GNSS_SCAN_PERIOD_S );
                    }
                    if (enableWiFiGNSS == 3) {
                        // cancel the current Wi-Fi scan (not possible if the scan has already started)
                        smtc_modem_wifi_scan_cancel( stack_id );
                        // set the new Wi-Fi scan period
                        smtc_modem_wifi_scan( stack_id, GEOLOCATION_WIFI_SCAN_PERIOD_S );
                        // cancel the current GNSS scan (not possible if the scan has already started)
                        smtc_modem_gnss_scan_cancel( stack_id );
                        // set the new GNSS scan period
                        smtc_modem_gnss_scan( stack_id, SMTC_MODEM_GNSS_MODE_MOBILE, GEOLOCATION_GNSS_SCAN_PERIOD_S );
                    }
                }

                // Convert rx_payload[3] to multiple varibales
                // The last 2 bits are for Wi-Fi and GNSS: 00 = none, 01 = Wi-Fi, 10 = GNSS, 11 = both
                // The next 2 bits are for the Class: 00 = A, 01 = B, 10 = C, 11 = D

                if (class_ != (rx_payload[3] & 0x0C)) {
                    class_ = rx_payload[3] & 0x0C;
                    SMTC_HAL_TRACE_PRINTF("Setting new class to %u\r\n", class_);
                    smtc_modem_join_network( stack_id, class_ );
                }

                if (enableWiFiGNSS != (rx_payload[3] & 0x03)) {
                    enableWiFiGNSS = rx_payload[3] & 0x03;
                    SMTC_HAL_TRACE_PRINTF("Setting new Wi-Fi and GNSS scan mode to %u\r\n", enableWiFiGNSS);


                    /* Schedule a Join LoRaWAN network */
                    smtc_modem_join_network( stack_id, class_ );
                    
                    switch (enableWiFiGNSS) {
                        case 0:
                            break;
                        case 1:
                            setupWiFi( stack_id );
                            break;
                        case 2:
                            setupGNSS( stack_id );
                            break;
                        case 3:
                            setupGNSS( stack_id );
                            setupWiFi( stack_id );
                            break;
                        default:
                            break;
                    }
                }

                // cancel the current Wi-Fi scan (not possible if the scan has already started)
                // smtc_modem_wifi_scan_cancel( stack_id );
                // set the new Wi-Fi scan period
                // smtc_modem_wifi_scan( stack_id, GEOLOCATION_WIFI_SCAN_PERIOD_S );


